# =============================================================================
# 6.1.2 创建数组的几种方式 by 王宇韬&肖金鑫
# =============================================================================

import numpy as np
# 创建一维数组
a = np.array([1, 2, 3, 4])
# 创建二维数组
b = np.array([[1, 2], [3, 4], [5, 6]])


# 其他创建数组的方式
# 1.通过np.arange()函数创建
# 一个参数 参数值为终点，起点取默认值0，步长取默认值1
x = np.arange(5)
# 两个参数 第一个参数为起点，第二个参数为终点，步长取默认值1，左闭右开
y = np.arange(5,10)
# 三个参数 第一个参数为起点，第二个参数为终点，第三个参数为步长，左闭右开
z = np.arange(5, 10, 0.5)
print(x)
print(y)
print(z)

# 2.通过np.random.randn()创建随机一维数组
c = np.random.randn(3)
print(c)

# 3.通过np.arange()函数和reshape方法产生二维数组
d = np.arange(12).reshape(3,4)
print(d)

# 4.创建一个随机二维数组
e = np.random.randint(0, 10, (4, 4))
print(e)





