# =============================================================================
# 6.1.1 Numpy与数组 by 王宇韬&肖金鑫
# =============================================================================

# 数组与列表的对比
import numpy as np
a = [1, 2, 3, 4]
b = np.array([1, 2, 3, 4])
print(a)
print(b)
print(type(a))
print(type(b))
print(a[1])
print(b[1])
print(a[0:2])
print(b[0:2])

# 数组的优势1-数组方便数学运算
c = a * 2
d = b * 2
print(c)
print(d)

# 数组的优势2-数组可以是多维的
e = [[1, 2], [3, 4], [5, 6]]  # 列表里的元素为小列表
f = np.array([[1, 2], [3, 4], [5, 6]])  # 创建二维数组的一种方式
print(e)
print(f)