# =============================================================================
# 12.2.2 通过groupby函数进行分组 by 王宇韬 & 房宇亮
# =============================================================================

# 1.先创建一个DataFrame
import pandas as pd
data = pd.DataFrame([['丁一', '阿里', 0.4, 0.2], ['王二', '百度', 0.2, 0.6], ['王二', '腾讯', 0.4, 0.8], ['张三', '京东', 0.1, 0.4], ['张三', '拼多多', 0.1, 0.2]], columns=['分析师', '股票名称', '30天收益率', '90天收益率'])
print(data)

# 2.根据分析师进行分组，并计算平均30天收益率均值
means = data.groupby('分析师')[['30天收益率']].mean()
print(means)

# 3.根据分析师及股票名称进行多重分组，并计算平均30天收益率均值
means = data.groupby(['分析师', '股票名称'])[['30天收益率']].mean()
print(means)

# 4.根据分析师进行分组，并计算其预测次数
count = data.groupby('分析师')[['30天收益率']].count()
print(count)
