# =============================================================================
# 1.2.1 变量、行、缩进与注释 by 华能信托-王宇韬
# =============================================================================

# 1 变量
x = 10
print(x)
x = x + 15
print(x)

# 2 行
# 代码都是一行一行写的

# 3 缩进，先不用管这个什么意思，之后会讲，只要知道在if和else后面那个语句要有个缩进，按Tab键快速缩进
x = 10
if x > 0:
    print('正数')
else:
    print('负数')

# 4 注释
'''
两种注释的方法：
1.#后的内容是注释的内容，# 是shift + 3按出来的
2.三个单引号左右包着
'''

# 这之后是注释内容,快捷键在pycharm里是ctrl + /,在spyder里是ctrl + 1
'''这里面是注释内容'''
