# =============================================================================
# 1.3.4 try except异常处理语句 by 华能信托-王宇韬
# =============================================================================

try:
    print(1 + 'a')
except:
    print('主代码运行失败')


# 下面为实战中的演示
try:
    # 这里是百度新闻爬取的代码
    print(1 + '1')
    print('百度新闻爬取成功')
except:
    print('百度新闻爬取失败')

try:
    # 这里是百度新闻爬取的代码，之后第五第七章会讲
    print(1 + 'a')
    print('百度新闻爬取成功')
except:
    print('百度新闻爬取失败')

try:
    # 这里是新浪财经新闻爬取的代码，之后爬虫进阶课会讲
    print('新浪财经新闻爬取成功')
except:
    print('新浪财经新闻爬取失败')

try:
    # 这里是微信推文爬取的代码，之后爬虫进阶课会讲
    print('微信推文爬取成功')
except:
    print('微信推文爬取失败')